zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA536/startup_MCXA536.c
#define _vStackTop  __StackTop
#define _vStackBase __StackLimit

/*
 * Data section ROM and RAM addresses
 */
extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];
extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];

#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)

//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif //(__cplusplus)
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (*const __Vectors[])(void);
#define __vector_table __Vectors
__attribute__((used, section(".isr_vector"))) void (*const __Vectors[])(void) = {
#elif defined(__MCUXPRESSO)
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));
#define __vector_table g_pfnVectors
__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
#elif defined(__ICCARM__)
extern void (*const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__((used, section(".intvec"))) void (*const __vector_table[])(void) = {
#elif defined(__GNUC__)
extern void (*const __isr_vector[])(void);
#define __vector_table __isr_vector
__attribute__((used, section(".isr_vector"))) void (*const __isr_vector[])(void) = {
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)
    // Core Level - CM33
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    MemManage_Handler,                  // MPU Fault Handler
    BusFault_Handler,                   // Bus Fault Handler
    UsageFault_Handler,                 // Usage Fault Handler
    SecureFault_Handler,                // Secure Fault Handler
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    DebugMon_Handler,                   // Debug Monitor Handler
    0,                                  // Reserved
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MCXA536
    Reserved16_IRQHandler,          // 16 : Reserved interrupt
    CMC_IRQHandler,                 // 17 : Core Mode Controller interrupt
    DMA0_CH0_IRQHandler,            // 18 : DMA3_0_CH0 error or transfer complete
    DMA0_CH1_IRQHandler,            // 19 : DMA3_0_CH1 error or transfer complete
    DMA0_CH2_IRQHandler,            // 20 : DMA3_0_CH2 error or transfer complete
    DMA0_CH3_IRQHandler,            // 21 : DMA3_0_CH3 error or transfer complete
    DMA0_CH4_IRQHandler,            // 22 : DMA3_0_CH4 error or transfer complete
    DMA0_CH5_IRQHandler,            // 23 : DMA3_0_CH5 error or transfer complete
    DMA0_CH6_IRQHandler,            // 24 : DMA3_0_CH6 error or transfer complete
    DMA0_CH7_IRQHandler,            // 25 : DMA3_0_CH7 error or transfer complete
    ERM0_SINGLE_BIT_IRQHandler,     // 26 : ERM Single Bit error interrupt
    ERM0_MULTI_BIT_IRQHandler,      // 27 : ERM Multi Bit error interrupt
    FMU0_IRQHandler,                // 28 : Flash Management Unit interrupt
    GLIKEY0_IRQHandler,             // 29 : GLIKEY Interrupt
    MBC0_IRQHandler,                // 30 : MBC secure violation interrupt
    SCG0_IRQHandler,                // 31 : System Clock Generator interrupt
    SPC0_IRQHandler,                // 32 : System Power Controller interrupt
    TDET_IRQHandler,                // 33 : TDET interrrupt
    WUU0_IRQHandler,                // 34 : Wake Up Unit interrupt
    CAN0_IRQHandler,                // 35 : Controller Area Network 0 interrupt
    CAN1_IRQHandler,                // 36 : Controller Area Network 1 interrupt
    Reserved37_IRQHandler,          // 37 : Reserved interrupt
    Reserved38_IRQHandler,          // 38 : Reserved interrupt
    FLEXIO_IRQHandler,              // 39 : Flexible Input/Output interrupt
    I3C0_IRQHandler,                // 40 : Improved Inter Integrated Circuit interrupt 0
    I3C1_IRQHandler,                // 41 : Improved Inter Integrated Circuit interrupt 1
    LPI2C0_IRQHandler,              // 42 : Low-Power Inter Integrated Circuit 0 interrupt
    LPI2C1_IRQHandler,              // 43 : Low-Power Inter Integrated Circuit 1 interrupt
    LPSPI0_IRQHandler,              // 44 : Low-Power Serial Peripheral Interface 0 interrupt
    LPSPI1_IRQHandler,              // 45 : Low-Power Serial Peripheral Interface 1 interrupt
    LPSPI2_IRQHandler,              // 46 : Low-Power Serial Peripheral Interface 2 interrupt
    LPUART0_IRQHandler,             // 47 : Low-Power Universal Asynchronous Receive/Transmit 0 interrupt
    LPUART1_IRQHandler,             // 48 : Low-Power Universal Asynchronous Receive/Transmit 1 interrupt
    LPUART2_IRQHandler,             // 49 : Low-Power Universal Asynchronous Receive/Transmit 2 interrupt
    LPUART3_IRQHandler,             // 50 : Low-Power Universal Asynchronous Receive/Transmit 3 interrupt
    LPUART4_IRQHandler,             // 51 : Low-Power Universal Asynchronous Receive/Transmit 4 interrupt
    Reserved52_IRQHandler,          // 52 : Reserved interrupt
    Reserved53_IRQHandler,          // 53 : Reserved interrupt
    CDOG0_IRQHandler,               // 54 : Code Watchdog Timer 0 interrupt
    CTIMER0_IRQHandler,             // 55 : Standard counter/timer 0 interrupt
    CTIMER1_IRQHandler,             // 56 : Standard counter/timer 1 interrupt
    CTIMER2_IRQHandler,             // 57 : Standard counter/timer 2 interrupt
    CTIMER3_IRQHandler,             // 58 : Standard counter/timer 3 interrupt
    CTIMER4_IRQHandler,             // 59 : Standard counter/timer 4 interrupt
    Reserved60_IRQHandler,          // 60 : Reserved interrupt
    Reserved61_IRQHandler,          // 61 : Reserved interrupt
    Reserved62_IRQHandler,          // 62 : Reserved interrupt
    Reserved63_IRQHandler,          // 63 : Reserved interrupt
    Reserved64_IRQHandler,          // 64 : Reserved interrupt
    Reserved65_IRQHandler,          // 65 : Reserved interrupt
    Reserved66_IRQHandler,          // 66 : Reserved interrupt
    Reserved67_IRQHandler,          // 67 : Reserved interrupt
    Reserved68_IRQHandler,          // 68 : Reserved interrupt
    Reserved69_IRQHandler,          // 69 : Reserved interrupt
    FREQME0_IRQHandler,             // 70 : Frequency Measurement interrupt
    LPTMR0_IRQHandler,              // 71 : Low Power Timer 0 interrupt
    Reserved72_IRQHandler,          // 72 : Reserved interrupt
    OS_EVENT_IRQHandler,            // 73 : OS event timer interrupt
    WAKETIMER0_IRQHandler,          // 74 : Wake Timer Interrupt
    UTICK0_IRQHandler,              // 75 : Micro-Tick Timer interrupt
    WWDT0_IRQHandler,               // 76 : Windowed Watchdog Timer 0 interrupt
    WWDT1_IRQHandler,               // 77 : Windowed Watchdog Timer 2 interrupt
    ADC0_IRQHandler,                // 78 : Analog-to-Digital Converter 0 interrupt
    ADC1_IRQHandler,                // 79 : Analog-to-Digital Converter 1 interrupt
    CMP0_IRQHandler,                // 80 : Comparator 0 interrupt
    Reserved81_IRQHandler,          // 81 : Reserved interrupt
    Reserved82_IRQHandler,          // 82 : Reserved interrupt
    DAC0_IRQHandler,                // 83 : Digital-to-Analog Converter 0 - General Purpose interrupt
    DAC1_IRQHandler,                // 84 : Digital-to-Analog Converter 1 - General Purpose interrupt
    Reserved85_IRQHandler,          // 85 : Reserved interrupt
    Reserved86_IRQHandler,          // 86 : Reserved interrupt
    GPIO0_IRQHandler,               // 87 : General Purpose Input/Output 0 interrupt 0
    GPIO1_IRQHandler,               // 88 : General Purpose Input/Output 1 interrupt 0
    GPIO2_IRQHandler,               // 89 : General Purpose Input/Output 2 interrupt 0
    GPIO3_IRQHandler,               // 90 : General Purpose Input/Output 3 interrupt 0
    GPIO4_IRQHandler,               // 91 : General Purpose Input/Output 4 interrupt 0
    GPIO5_IRQHandler,               // 92 : General Purpose Input/Output 5 interrupt 0
    LPI2C2_IRQHandler,              // 93 : Low-Power Inter Integrated Circuit 2 interrupt
    LPI2C3_IRQHandler,              // 94 : Low-Power Inter Integrated Circuit 3 interrupt
    Reserved95_IRQHandler,          // 95 : Reserved interrupt
    Reserved96_IRQHandler,          // 96 : Reserved interrupt
    Reserved97_IRQHandler,          // 97 : Reserved interrupt
    Reserved98_IRQHandler,          // 98 : Reserved interrupt
    Reserved99_IRQHandler,          // 99 : Reserved interrupt
    Reserved100_IRQHandler,         // 100: Reserved interrupt
    Reserved101_IRQHandler,         // 101: Reserved interrupt
    Reserved102_IRQHandler,         // 102: Reserved interrupt
    Reserved103_IRQHandler,         // 103: Reserved interrupt
    Reserved104_IRQHandler,         // 104: Reserved interrupt
    ESPI_IRQHandler,                // 105: eSPI interrupt
    ETHERNET_IRQHandler,            // 106: Ethernet QoS interrupt
    ETHERNET_PMT_IRQHandler,        // 107: Ethernet QoS power management interrupt
    Reserved108_IRQHandler,         // 108: Reserved interrupt
    TENBASET_PHY0_IRQHandler,       // 109: 10Base-T1S interrupt
    I3C2_IRQHandler,                // 110: Improved Inter Integrated Circuit interrupt 2
    LPUART5_IRQHandler,             // 111: Low-Power Universal Asynchronous Receive/Transmit interrupt
    Reserved112_IRQHandler,         // 112: Reserved interrupt
    LPSPI3_IRQHandler,              // 113: Low-Power Serial Peripheral Interface 3 interrupt
    LPSPI4_IRQHandler,              // 114: Low-Power Serial Peripheral Interface 4 interrupt
    LPSPI5_IRQHandler,              // 115: Low-Power Serial Peripheral Interface 5 interrupt
    LPI2C4_IRQHandler,              // 116: Low-Power Inter Integrated Circuit 4 interrupt
    I3C3_IRQHandler,                // 117: Improved Inter Integrated Circuit interrupt 3
    Reserved118_IRQHandler,         // 118: Reserved interrupt
    USB1_HS_IRQHandler,             // 119: USB High Speed OTG Controller interrupt
    USB1_HS_PHY_IRQHandler,         // 120: USBHS DCD or USBHS Phy interrupt
    Reserved121_IRQHandler,         // 121: Reserved interrupt
    FLEXSPI0_IRQHandler,            // 122: Flexible Serial Peripheral Interface interrupt
    Reserved123_IRQHandler,         // 123: Reserved interrupt
    SMARTDMA_IRQHandler,            // 124: SmartDMA interrupt
    CDOG1_IRQHandler,               // 125: Code Watchdog Timer 1 interrupt
    PKC_IRQHandler,                 // 126: PKC interrupt
    SGI_IRQHandler,                 // 127: SGI interrupt
    Reserved128_IRQHandler,         // 128: Reserved interrupt
    TRNG0_IRQHandler,               // 129: True Random Number Generator interrupt
    SECURE_ERR_IRQHandler,          // 130: Secure IP Error interrupt. It OR SGI, PKC, TRNG error together.
    SEC_HYPERVISOR_CALL_IRQHandler, // 131: AHB Secure Controller hypervisor call interrupt
    Reserved132_IRQHandler,         // 132: Reserved interrupt
    Reserved133_IRQHandler,         // 133: Reserved interrupt
    Reserved134_IRQHandler,         // 134: Reserved interrupt
    RTC_IRQHandler,                 // 135: RTC alarm interrupt
    Reserved136_IRQHandler,         // 136: Reserved interrupt
    Reserved137_IRQHandler,         // 137: Reserved interrupt
    DGDET0_IRQHandler,              // 138: Digital Glitch Detect 0 interrupt
    EWM_IRQHandler,                 // 139: External Watchdog Monitor interrupt
    TSI_END_OF_SCAN_IRQHandler,     // 140: TSI End of Scan interrupt
    TSI_OUT_OF_SCAN_IRQHandler,     // 141: TSI Out of Scan interrupt
    GPIO0_1_IRQHandler,             // 142: General Purpose Input/Output 0 interrupt 1
    GPIO1_1_IRQHandler,             // 143: General Purpose Input/Output 1 interrupt 1
    GPIO2_1_IRQHandler,             // 144: General Purpose Input/Output 2 interrupt 1
    GPIO3_1_IRQHandler,             // 145: General Purpose Input/Output 3 interrupt 1
    GPIO4_1_IRQHandler,             // 146: General Purpose Input/Output 4 interrupt 1
    GPIO5_1_IRQHandler,             // 147: General Purpose Input/Output 5 interrupt 1
    Reserved148_IRQHandler,         // 148: Reserved interrupt
    ITRC0_IRQHandler,               // 149: Intrusion and Tamper Response Controller interrupt
    DMA0_CH8_IRQHandler,            // 150: DMA3_0_CH8 error or transfer complete
    DMA0_CH9_IRQHandler,            // 151: DMA3_0_CH9 error or transfer complete
    DMA0_CH10_IRQHandler,           // 152: DMA3_0_CH10 error or transfer complete
    DMA0_CH11_IRQHandler,           // 153: DMA3_0_CH11 error or transfer complete
    Reserved154_IRQHandler,         // 154: Reserved interrupt
    Reserved155_IRQHandler,         // 155: Reserved interrupt
    Reserved156_IRQHandler,         // 156: Reserved interrupt
    Reserved157_IRQHandler,         // 157: Reserved interrupt
    DMA1_CH0_IRQHandler,            // 158: DMA3_1_CH0 error or transfer complete
    DMA1_CH1_IRQHandler,            // 159: DMA3_1_CH1 error or transfer complete
    DMA1_CH2_IRQHandler,            // 160: DMA3_1_CH2 error or transfer complete
    DMA1_CH3_IRQHandler,            // 161: DMA3_1_CH3 error or transfer complete
};                                     /* End of __vector_table */

#if defined(__MCUXPRESSO)
#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void *__VECTOR_TABLE __attribute__((alias("g_pfnVectors")));
void (*__VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif //(ENABLE_RAM_VECTOR_TABLE)

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif //(__MCUXPRESSO)

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif //(__NO_SYSTEM_INIT)

